artifacts/wsdl/bookings.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
             xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy"
             xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://service.second.webservice.kth.se/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
             targetNamespace="http://service.second.webservice.kth.se/" name="BookTicketService">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://service.second.webservice.kth.se/"
                        schemaLocation="http://localhost:9091/bookings?xsd=1"></xsd:import>
        </xsd:schema>
    </types>
    <message name="checkAvailability">
        <part name="parameters" element="tns:checkAvailability"></part>
    </message>
    <message name="checkAvailabilityResponse">
        <part name="parameters" element="tns:checkAvailabilityResponse"></part>
    </message>
    <message name="bookTicket">
        <part name="parameters" element="tns:bookTicket"></part>
    </message>
    <message name="bookTicketResponse">
        <part name="parameters" element="tns:bookTicketResponse"></part>
    </message>
    <portType name="BookTicket">
        <operation name="checkAvailability">
            <input wsam:Action="http://service.second.webservice.kth.se/BookTicket/checkAvailabilityRequest"
                   message="tns:checkAvailability"></input>
            <output wsam:Action="http://service.second.webservice.kth.se/BookTicket/checkAvailabilityResponse"
                    message="tns:checkAvailabilityResponse"></output>
        </operation>
        <operation name="bookTicket">
            <input wsam:Action="http://service.second.webservice.kth.se/BookTicket/bookTicketRequest"
                   message="tns:bookTicket"></input>
            <output wsam:Action="http://service.second.webservice.kth.se/BookTicket/bookTicketResponse"
                    message="tns:bookTicketResponse"></output>
        </operation>
    </portType>
    <binding name="BookTicketPortBinding" type="tns:BookTicket">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
        <operation name="checkAvailability">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal"></soap:body>
            </input>
            <output>
                <soap:body use="literal"></soap:body>
            </output>
        </operation>
        <operation name="bookTicket">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal"></soap:body>
            </input>
            <output>
                <soap:body use="literal"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="BookTicketService">
        <port name="BookTicketPort" binding="tns:BookTicketPortBinding">
            <soap:address location="http://localhost:9091/bookings"></soap:address>
        </port>
    </service>
</definitions>