artifacts/messages/task5/requestBooking.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body>
        <ns2:bookTicket xmlns:ns2="http://service.second.webservice.kth.se/">
            <arg0>446167</arg0>
            <arg1>123123123123123123</arg1>
        </ns2:bookTicket>
    </S:Body>
</S:Envelope>