artifacts/messages/task3and4/requestAvailability.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body>
        <ns2:checkAvailability xmlns:ns2="http://service.second.webservice.kth.se/">
            <arg0>446167</arg0>
        </ns2:checkAvailability>
    </S:Body>
</S:Envelope>